src/main/resources/user-request.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:us="http://github.com/MarianaVorotniak/spring-boot-soap-demo">

    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Mariana</us:name>
        </us:getUserRequest>
    </soapenv:Body>

</soapenv:Envelope>